-- MySQL dump 10.13  Distrib 8.0.30, for Win64 (x86_64)
--
-- Host: localhost    Database: exam
-- ------------------------------------------------------
-- Server version	8.0.30

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `board`
--

DROP TABLE IF EXISTS `board`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `board` (
  `bno` int NOT NULL AUTO_INCREMENT,
  `title` varchar(20) NOT NULL,
  `content` varchar(1000) DEFAULT NULL,
  `regdate` datetime DEFAULT CURRENT_TIMESTAMP,
  `count` int DEFAULT '0',
  `id` varchar(18) DEFAULT NULL,
  PRIMARY KEY (`bno`),
  KEY `id_fk` (`id`),
  CONSTRAINT `id_fk` FOREIGN KEY (`id`) REFERENCES `member` (`id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=186 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `board`
--

LOCK TABLES `board` WRITE;
/*!40000 ALTER TABLE `board` DISABLE KEYS */;
INSERT INTO `board` VALUES (19,'반갑습니다','반가워요','2022-07-27 09:58:06',9,'ddd444'),(20,'조은아침','좋은아침','2022-07-27 09:58:49',0,'bbb222'),(21,'goooooooooooooooood','morning1111111111111111','2022-07-27 09:59:19',3,'bbb222'),(22,'Hi!!','반가워요\r\n첫인사입니다','2022-07-27 09:59:51',1,'ccc333'),(25,'가입했어요','반가워요\r\n제이름은 eee555입니다','2022-07-27 10:03:29',20,'eee555'),(26,'good','하하하하하핳하','2022-07-27 10:11:08',1,'eee555'),(29,'hello','hi~','2022-07-27 11:05:40',0,'ddd444'),(33,'글쓰기2','게시판 글쓰기','2022-07-28 11:22:58',0,'ccc333'),(34,'로그인 되어야','글쓰기 가능합니다.','2022-07-28 12:27:27',0,'ccc333'),(35,'첫인사','안녕하세요','2022-07-29 10:06:09',0,'fff666'),(40,'글쓰기2','jsp연습해요','2022-07-29 10:49:53',0,'fff666'),(41,'글쓰기3','연습중','2022-07-29 10:57:21',0,'fff666'),(46,'ㅁㅈㄹㅈㅁㄹ','ㅁㅈㄹㅈ','2022-08-09 16:42:30',0,NULL),(53,'어푸어푸','하하하하awfe','2022-08-09 17:07:23',0,NULL),(55,'제목','내용','2022-08-09 17:08:02',0,NULL),(56,'8/10','테스트를 합시다','2022-08-10 09:21:31',0,NULL),(57,'화면이동확인중','글쓰기 insert가 되었습니다.','2022-08-10 11:52:34',0,NULL),(58,'글쓰기 테스트','sql에 insert되었음을 확인합니다.','2022-08-10 13:32:03',0,NULL),(59,'redirect 화면','화면이동을 확인하는 테스트 중입니다.','2022-08-10 14:23:29',0,NULL),(60,'타이틀','내용내용내용','2022-08-16 11:05:14',0,'ccc333'),(61,'타이틀','내용내용내용','2022-08-16 11:05:14',0,'ccc333'),(62,'타이틀','내용내용내용','2022-08-16 11:05:14',0,'ccc333'),(63,'타이틀','내용내용내용','2022-08-16 11:05:14',0,'ccc333'),(64,'타이틀','내용내용내용','2022-08-16 11:05:14',0,'ccc333'),(65,'타이틀','내용내용내용','2022-08-16 11:05:14',0,'ccc333'),(66,'타이틀','내용내용내용','2022-08-16 11:05:14',0,'ccc333'),(67,'타이틀','내용내용내용','2022-08-16 11:05:14',0,'ccc333'),(68,'타이틀','내용내용내용2','2022-08-16 11:05:45',0,'eee555'),(69,'타이틀','내용내용내용2','2022-08-16 11:05:45',0,'eee555'),(70,'타이틀','내용내용내용2','2022-08-16 11:05:45',0,'eee555'),(71,'타이틀','내용내용내용2','2022-08-16 11:05:45',0,'eee555'),(72,'타이틀','내용내용내용2','2022-08-16 11:05:45',0,'eee555'),(73,'타이틀','내용내용내용2','2022-08-16 11:05:45',0,'eee555'),(74,'타이틀','내용내용내용2','2022-08-16 11:05:45',0,'eee555'),(75,'타이틀','내용내용내용2','2022-08-16 11:05:45',0,'eee555'),(76,'타이틀','내용내용내용2','2022-08-16 11:05:45',0,'eee555'),(77,'타이틀4','내용내용내용4','2022-08-16 11:06:20',0,'ddd444'),(78,'타이틀4','내용내용내용4','2022-08-16 11:06:20',0,'ddd444'),(79,'타이틀4','내용내용내용4','2022-08-16 11:06:20',0,'ddd444'),(80,'타이틀4','내용내용내용4','2022-08-16 11:06:20',0,'ddd444'),(81,'타이틀4','내용내용내용4','2022-08-16 11:06:20',0,'ddd444'),(82,'타이틀4','내용내용내용4','2022-08-16 11:06:20',0,'ddd444'),(83,'타이틀4','내용내용내용4','2022-08-16 11:06:20',0,'ddd444'),(84,'타이틀4','내용내용내용4','2022-08-16 11:06:20',0,'ddd444'),(85,'타이틀4','내용내용내용4','2022-08-16 11:06:20',0,'ddd444'),(86,'타이틀4','내용내용내용4','2022-08-16 11:06:20',0,'ddd444'),(87,'타이틀4','내용내용내용4','2022-08-16 11:06:20',0,'ddd444'),(88,'타이틀4','내용내용내용4','2022-08-16 11:06:20',0,'ddd444'),(89,'타이틀4','내용내용내용4','2022-08-16 11:06:31',0,'ddd444'),(90,'타이틀4','내용내용내용4','2022-08-16 11:06:31',0,'ddd444'),(91,'타이틀4','내용내용내용4','2022-08-16 11:06:31',0,'ddd444'),(92,'타이틀4','내용내용내용4','2022-08-16 11:06:31',0,'ddd444'),(93,'타이틀4','내용내용내용4','2022-08-16 11:06:31',0,'ddd444'),(94,'타이틀4','내용내용내용4','2022-08-16 11:06:31',0,'ddd444'),(95,'타이틀4','내용내용내용4','2022-08-16 11:06:31',0,'ddd444'),(96,'타이틀4','내용내용내용4','2022-08-16 11:06:31',0,'ddd444'),(97,'타이틀4','내용내용내용4','2022-08-16 11:06:31',0,'ddd444'),(98,'타이틀4','내용내용내용4','2022-08-16 11:06:31',0,'ddd444'),(99,'타이틀4','내용내용내용4','2022-08-16 11:06:31',0,'ddd444'),(100,'타이틀4','내용내용내용4','2022-08-16 11:06:31',0,'ddd444'),(101,'타이틀4','내용내용내용4','2022-08-16 11:06:33',0,'ddd444'),(102,'타이틀4','내용내용내용4','2022-08-16 11:06:33',0,'ddd444'),(103,'타이틀4','내용내용내용4','2022-08-16 11:06:33',0,'ddd444'),(104,'타이틀4','내용내용내용4','2022-08-16 11:06:33',0,'ddd444'),(105,'타이틀4','내용내용내용4','2022-08-16 11:06:33',0,'ddd444'),(106,'타이틀4','내용내용내용4','2022-08-16 11:06:33',0,'ddd444'),(107,'타이틀4','내용내용내용4','2022-08-16 11:06:33',0,'ddd444'),(108,'타이틀4','내용내용내용4','2022-08-16 11:06:33',0,'ddd444'),(109,'타이틀4','내용내용내용4','2022-08-16 11:06:33',0,'ddd444'),(110,'타이틀4','내용내용내용4','2022-08-16 11:06:33',0,'ddd444'),(111,'타이틀4','내용내용내용4','2022-08-16 11:06:33',0,'ddd444'),(112,'타이틀4','내용내용내용4','2022-08-16 11:06:33',0,'ddd444'),(113,'타이틀6','내용내용내용6','2022-08-16 11:07:07',0,'fff666'),(114,'타이틀6','내용내용내용6','2022-08-16 11:07:07',0,'fff666'),(115,'타이틀6','내용내용내용6','2022-08-16 11:07:07',0,'fff666'),(116,'타이틀6','내용내용내용6','2022-08-16 11:07:07',0,'fff666'),(117,'타이틀6','내용내용내용6','2022-08-16 11:07:07',0,'fff666'),(118,'타이틀6','내용내용내용6','2022-08-16 11:07:07',0,'fff666'),(119,'타이틀6','내용내용내용6','2022-08-16 11:07:07',0,'fff666'),(120,'타이틀6','내용내용내용6','2022-08-16 11:07:07',0,'fff666'),(121,'타이틀6','내용내용내용6','2022-08-16 11:07:07',0,'fff666'),(122,'타이틀6','내용내용내용6','2022-08-16 11:07:07',0,'fff666'),(123,'타이틀6','내용내용내용6','2022-08-16 11:07:07',0,'fff666'),(124,'타이틀6','내용내용내용6','2022-08-16 11:07:07',0,'fff666'),(125,'타이틀6','내용내용내용6','2022-08-16 11:07:07',0,'fff666'),(126,'타이틀6','내용내용내용6','2022-08-16 11:07:07',0,'fff666'),(127,'타이틀6','내용내용내용6','2022-08-16 11:07:07',0,'fff666'),(128,'타이틀6','내용내용내용6','2022-08-16 11:07:07',0,'fff666'),(129,'타이틀6','내용내용내용6','2022-08-16 11:07:07',0,'fff666'),(130,'타이틀6','내용내용내용6','2022-08-16 11:07:07',0,'fff666'),(131,'타이틀6','내용내용내용6','2022-08-16 11:07:37',0,'fff666'),(132,'타이틀6','내용내용내용6','2022-08-16 11:07:37',0,'fff666'),(133,'타이틀6','내용내용내용6','2022-08-16 11:07:37',0,'fff666'),(134,'타이틀6','내용내용내용6','2022-08-16 11:07:37',0,'fff666'),(135,'타이틀6','내용내용내용6','2022-08-16 11:07:37',0,'fff666'),(136,'타이틀6','내용내용내용6','2022-08-16 11:07:37',0,'fff666'),(137,'타이틀6','내용내용내용6','2022-08-16 11:07:37',0,'fff666'),(138,'타이틀6','내용내용내용6','2022-08-16 11:07:37',0,'fff666'),(139,'타이틀6','내용내용내용6','2022-08-16 11:07:37',0,'fff666'),(140,'타이틀6','내용내용내용6','2022-08-16 11:07:37',0,'fff666'),(141,'타이틀6','내용내용내용6','2022-08-16 11:07:37',0,'fff666'),(142,'타이틀6','내용내용내용6','2022-08-16 11:07:37',0,'fff666'),(143,'타이틀6','내용내용내용6','2022-08-16 11:07:37',0,'fff666'),(144,'타이틀6','내용내용내용6','2022-08-16 11:07:37',0,'fff666'),(145,'타이틀6','내용내용내용6','2022-08-16 11:07:37',0,'fff666'),(146,'타이틀6','내용내용내용6','2022-08-16 11:07:37',0,'fff666'),(147,'타이틀6','내용내용내용6','2022-08-16 11:07:37',0,'fff666'),(148,'타이틀6','내용내용내용6','2022-08-16 11:07:37',0,'fff666'),(149,'타이틀6','내용내용내용6','2022-08-16 11:08:24',0,'fff666'),(150,'타이틀6','내용내용내용6','2022-08-16 11:08:24',0,'fff666'),(151,'타이틀6','내용내용내용6','2022-08-16 11:08:24',0,'fff666'),(152,'타이틀6','내용내용내용6','2022-08-16 11:08:24',0,'fff666'),(153,'타이틀6','내용내용내용6','2022-08-16 11:08:24',0,'fff666'),(154,'타이틀6','내용내용내용6','2022-08-16 11:08:24',0,'fff666'),(155,'타이틀6','내용내용내용6','2022-08-16 11:08:24',0,'fff666'),(156,'타이틀6','내용내용내용6','2022-08-16 11:08:24',0,'fff666'),(157,'타이틀6','내용내용내용6','2022-08-16 11:08:24',0,'fff666'),(158,'타이틀6','내용내용내용6','2022-08-16 11:08:24',0,'fff666'),(159,'타이틀6','내용내용내용6','2022-08-16 11:08:24',0,'fff666'),(160,'타이틀6','내용내용내용6','2022-08-16 11:08:24',3,'fff666'),(161,'타이틀6','내용내용내용6','2022-08-16 11:08:24',16,'fff666'),(162,'타이틀6','내용내용내용6','2022-08-16 11:08:24',21,'fff666'),(163,'타이틀6','내용내용내용6','2022-08-16 11:08:24',36,'fff666'),(164,'타이틀6','내용내용내용6','2022-08-16 11:08:24',36,'fff666'),(165,'타이틀6','내용내용내용6','2022-08-16 11:08:24',167,'fff666'),(166,'타이틀6','내용내용내용6','2022-08-16 11:08:24',85,'fff666'),(174,'아이디도 들어가는지','확인하고싶어요','2022-08-26 12:19:18',2,'eee555'),(176,'이미지파일, 이미지 아닌 파일','다첨부해볼게요뉴나뉴나','2022-08-26 14:46:05',24,'bbb222'),(177,'test','연결되나요','2022-08-26 16:17:59',9,'eee555'),(178,'반가워요','사진올림','2022-08-29 09:39:44',55,'eee555'),(179,'안녕ㅅ하세염','글을 써봅니다.\r\n내가쓴건 수정됩니다.','2022-08-29 12:11:30',63,'eee555'),(180,'테스트 중입니다','ㄴㅇㄹㄴㅇㄹ우헤헤헤헤헤dfgdfgdfg','2022-08-29 14:19:25',57,'fff666'),(181,'오늘은 화요일','우헤헤헤헤헤','2022-08-30 12:28:23',32,'eee555'),(182,'오늘 날씨가','구려요 구릿구릿','2022-08-30 13:51:43',90,'bbb222'),(183,'헤헤헤헤','ㄴㅇㄹㄴㅇㄹㄴㅇㄹ','2022-09-14 09:26:45',77,'eee555'),(184,'좋아요 도전중','ㄴㅇㄹㄴㅇㄹ','2022-09-20 14:42:30',35,'iii777'),(185,'하트를 보세요','좋아요 되나여','2022-09-21 11:53:26',1,'iii777');
/*!40000 ALTER TABLE `board` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2022-11-15 14:14:45
